; domain
(define (domain BeadRingMaking)
  (:requirements :strips :typing)
  
  (:types
    bead
    elastic
    tail
    person
  )

  (:predicates
    (cut ?e - elastic)
    (on_strip ?b - bead)
    (in_order ?b - bead)
    (curved ?e - elastic)
    (adorned ?t - tail)
    (admiring ?p - person)
  )

  (:action CutElastic
    :parameters (?e - elastic)
    :precondition (not (cut ?e))
    :effect (cut ?e)
  )

  (:action SlipLargerBeads
    :parameters (?b - bead)
    :precondition (and (not (on_strip ?b)) (not (in_order ?b)))
    :effect (and (on_strip ?b) (in_order ?b))
  )

  (:action SlipSmallBead
    :parameters (?b - bead)
    :precondition (not (on_strip ?b))
    :effect (on_strip ?b)
  )

  (:action PatternBeads
    :parameters (?b - bead)
    :precondition (not (in_order ?b))
    :effect (in_order ?b)
  )

  (:action FinishRing
    :parameters (?e - elastic ?t - tail)
    :precondition (and (not (curved ?e)) (not (adorned ?t)))
    :effect (and (curved ?e) (adorned ?t))
  )

  (:action AdmireRing
    :parameters (?p - person)
    :precondition (not (admiring ?p))
    :effect (admiring ?p)
  )
)

; problem
(define (problem MakeBeadRing)
  (:domain BeadRingMaking)
  
  (:objects
    bead1 bead2 bead3 - bead
    elastic1 - elastic
    tail1 - tail
    you - person
  )
  
  (:init
    (not (cut elastic1))
    (not (on_strip bead1)) (not (on_strip bead2)) (not (on_strip bead3))
    (not (in_order bead1)) (not (in_order bead2)) (not (in_order bead3))
    (not (curved elastic1))
    (not (adorned tail1))
    (not (admiring you))
  )

  (:goal
    (and
      (cut elastic1)
      (on_strip bead1) (in_order bead1)
      (on_strip bead2) (in_order bead2)
      (on_strip bead3) (in_order bead3)
      (curved elastic1)
      (adorned tail1)
      (admiring you)
    )
  )
)

; plan
1. (sliplargerbeads bead3)
   added: (on_strip bead3) (in_order bead3)
   goals met: 2 of 10
2. (sliplargerbeads bead2)
   added: (on_strip bead2) (in_order bead2)
   goals met: 4 of 10
3. (sliplargerbeads bead1)
   added: (on_strip bead1) (in_order bead1)
   goals met: 6 of 10
4. (cutelastic elastic1)
   added: (cut elastic1)
   goals met: 7 of 10
5. (finishring elastic1 tail1)
   added: (curved elastic1) (adorned tail1)
   goals met: 9 of 10
6. (admirering you)
   added: (admiring you)
   goals met: 10 of 10
